# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

des_namber = int(input('Введите число в десятичной системе счисления : '))
print(bin(des_namber))